// ====================== КНОПКИ (клиент) ======================

&НаКлиенте
Процедура Создать(Команда)
    СоздатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтруктуруПользователей(Команда)
    ОбработатьСтруктуруПользователейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПользователиБезОтчества(Команда)
    ПользователиБезОтчестваНаСервере();
КонецПроцедуры


// ====================== СЕРВЕРНЫЕ ВЫЗОВЫ ======================

&НаСервере
Процедура СоздатьНаСервере()
    
    ТекОбъект = Обработки.ОбработкаПользователи.Создать();
    
    ВремМассив = ТекОбъект.СоздатьСтруктуруПользователей();
    
    ТаблицаПользователей.Очистить();
    
    Для Каждого Стр Из ВремМассив Цикл
        НоваяСтрока = ТаблицаПользователей.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
    КонецЦикла;
    
    Сообщить("Таблица заполнена. Всего элементов: " + ТаблицаПользователей.Количество());
    
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтруктуруПользователейНаСервере()
    
    Если ТаблицаПользователей.Количество() = 0 Тогда
        Сообщить("Таблица пуста! Сначала нажмите кнопку 'Создать'.");
        Возврат;
    КонецЕсли;
	
	КопияДляОбработки = Новый Массив;
    Для Каждого СтрокаТЧ Из ТаблицаПользователей Цикл
        ТекСтруктура = Новый Структура("Код, Фамилия, Имя", СтрокаТЧ.Код, СтрокаТЧ.Фамилия, СтрокаТЧ.Имя);
        КопияДляОбработки.Добавить(ТекСтруктура);
    КонецЦикла;
    
    ТекОбъект = Обработки.ОбработкаПользователи.Создать();
    ТекОбъект.ОбработатьСтруктуруПользователей(КопияДляОбработки);
    
    Если ТаблицаПользователей.Количество() > 0 Тогда
        ПоследнийИндекс = ТаблицаПользователей.Количество() - 1;
        ТаблицаПользователей.Удалить(ПоследнийИндекс);
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПользователиБезОтчестваНаСервере()
    
    ТекОбъект = Обработки.ОбработкаПользователи.Создать();
    
    РезультатЗапроса = ТекОбъект.ПолучитьПользователейБезОтчества();     
    ТаблицаПользователей.Очистить();
    
    Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
        НоваяСтрока = ТаблицаПользователей.Добавить();
        ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
    КонецЦикла;
    
    Сообщить("Пользователи без отчества выведены в таблицу.");
    
КонецПроцедуры