Процедура ОбработкаПроверкиЗаполнения (Отказ, ПроверяемыеРеквизиты)

	ЭтотОбъект.Сумма = 0;
	
	Для Каждого СтрокаТЧ Из Товары Цикл
		СтрокаТч.СуммаСтроки = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
		
		ЭтотОбъект.Сумма = ЭтотОбъект.Сумма + СтрокаТЧ.СуммаСтроки;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.Сумма > 100 Тогда
		Сообщить("Общая сумма превышает 100! Увеличиваем на 20%.", СтатусСообщения.Важное);
		ЭтотОбъект.Сумма = ЭтотОбъект.Сумма * 1.2;
	КонецЕсли;
	
КонецПроцедуры